[
    {
        "title": "Sign Language Detection",
        "year": "2024",
        "image": "/images/Sign-Language.png",
        "description": "Utilized TensorFlow and Keras to construct a deep neural network with LSTM layers, allowing the model to effectively decode sign language from sequences of key points extracted using MediaPipe."
    },
    {
        "title": "Handwritten Digit and Character Classification",
        "year": "2023",
        "image": "/images/Handwritten_digit.jpg",
        "description": "Implemented a handwritten digit recognition application using the MNIST dataset, leveraging CNNs to achieve high accuracy in classifying digits. Developed a GUI for real-time recognition capabilities."
    },
    {
        "title": "NBA MVP Predictor",
        "year": "2022",
        "image": "/images/Lebron_MVP.jpg",
        "description": "Predicted the NBA's Most Valuable Player using machine learning algorithms, including Linear Regression, Ridge Regression, Random Forest, and Boosted Trees."
    },
    {
        "title": "Time Series Analysis on LA Weather Forecast",
        "year": "2023",
        "image": "/images/LA_Temp.jpg",
        "description": "Analyzed monthly weather patterns in Downtown Los Angeles using SARIMA and Lagged Regression to explore global warming, seasonal variations, and significant weather trends."
    },
    {
        "title": "ECG Irregular Heartbeat Diagnosis",
        "year": "2024",
        "image": "/images/heartbeat.jpg",
        "description": "Used ECG data from Lawrence Livermore National Laboratory for binary classification of healthy vs irregular heartbeats, achieving 99% accuracy. Also performed multiclass classification for various heartbeat types using multiple models."
    },
    {
        "title": "YouTube Data Analysis",
        "year": "2023",
        "image": "/images/youtube-4k-.jpg",
        "description": "Conducted data analysis on YouTube trends to understand content patterns, viewer engagement, and influential factors across various categories."
    },
    {
        "title": "World Happiness Report 2023",
        "year": "2023",
        "image": "/images/WHR.png",
        "description": "Explored the World Happiness Report 2023 to analyze factors affecting life satisfaction in North America, identifying meaningful patterns across diverse countries."
    },
    {
        "title": "Tableau: Video Games Sales Dashboard",
        "year": "2022",
        "image": "/images/video_games.png",
        "description": "Created an interactive dashboard in Tableau to explore video game sales by region, year, publisher, and title, offering insights through dynamic filters."
    },
    {
        "title": "Fertility Rate and Population Growth by Continent",
        "year": "2024",
        "image": "/images/Fertility_Rate.jpg",
        "description": "Analyzed UNdata on population growth and fertility rates across continents, observing a decline over time and exploring socioeconomic factors influencing these trends."
    },
    {
        "title": "Credit Card Classifier",
        "year": "2021",
        "image": "/images/credit_card.jpg",
        "description": "Developed a classifier to detect fraudulent credit card transactions, applying techniques like Decision Trees, Random Forest, and Logistic Regression to improve accuracy."
    },
    {
        "title": "Tableau: Asians in Fortune 1000 Companies",
        "year": "2024",
        "image": "/images/Fortune_1000.jpg",
        "description": "Built a dashboard to visualize the representation of Asian executives in Fortune 1000 companies, aiming to understand racial diversity in leadership roles."
    },
    {
        "title": "Star and Galaxy Classification",
        "year": "2021",
        "image": "/images/galaxy.jpg",
        "description": "Classified stars and galaxies using a 34,000-image dataset from HSC, employing image preprocessing and deep learning techniques to enhance accuracy."
    }
]
